Revit 2024 API
DWFImportOptions Class
 The import options used by importing DWF or DWFx format file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class DWFImportOptions : IDisposable
Visual Basic
Public Class DWFImportOptions _
	Implements IDisposable
Visual C++
public ref class DWFImportOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DWFImportOptions
See Also
DWFImportOptions Members
Autodesk.Revit.DB Namespace